flow-examples/class6/requestUpdate.xml

<soap:Envelope xmlns:soap="http://www.w3.org/2003/05/soap-envelope" 
xmlns:dat="http://ws.wso2.org/dataservice">
   <soap:Header/>
   <soap:Body>
      <dat:mockUpdate>
         <dat:telefone>444444</dat:telefone>
         <dat:cidade>555555</dat:cidade>
         <dat:pais>666666</dat:pais>
         <dat:nome>fulano3</dat:nome>
      </dat:mockUpdate>
   </soap:Body>
</soap:Envelope>